---
title: DimensionSegment
classe: Autodesk.Revit.DB.DimensionSegment
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# DimensionSegment

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Above { get; set; }` | `dimensionSegment.Above` | String |
| `String Below { get; set; }` | `dimensionSegment.Below` | String |
| `Boolean IsLocked { get; set; }` | `dimensionSegment.IsLocked` | Boolean |
| `XYZ LeaderEndPosition { get; set; }` | `dimensionSegment.LeaderEndPosition` | XYZ |
| `XYZ Origin { get; }` | `dimensionSegment.Origin` | XYZ |
| `String Prefix { get; set; }` | `dimensionSegment.Prefix` | String |
| `String Suffix { get; set; }` | `dimensionSegment.Suffix` | String |
| `XYZ TextPosition { get; set; }` | `dimensionSegment.TextPosition` | XYZ |
| `Nullable<Double> Value { get; }` | `dimensionSegment.Value` | Nullable<Double> |
| `String ValueOverride { get; set; }` | `dimensionSegment.ValueOverride` | String |
| `String ValueString { get; }` | `dimensionSegment.ValueString` | String |
| `Boolean IsTextPositionAdjustable()` | `dimensionSegment.IsTextPositionAdjustable()` | Boolean |
| `Void ResetTextPosition()` | `dimensionSegment.ResetTextPosition()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```